{
    "content": "<h2 id=\"Introduction\" name=\"Introduction\">Introduction</h2>\n\n<p>Bindings can define methods and properties on a bound element using the <code>implementation</code> tag. A binding implementation provides a new set of methods and properties that can be invoked directly from the bound element.</p>\n\n<p>The methods and properties of an implementation can be defined declaratively using <code>method</code> and <code>property</code> tags in XML, or an external implementation (e.g., a binary implementation) can be specified using the <code>src</code> attribute. When the <code>src</code> attribute is specified, any children of the <code>implementation</code> element are ignored.</p>\n\n<h2 id=\"Methods\" name=\"Methods\">Methods</h2>\n\n<p>Methods are defined using the <code>method</code> element. The name given on the tag using the <code>name</code> attribute is the name that can be used to invoke the method on the element. A <code>method</code> with parameters specifies those parameters and their names with <code>parameter</code> elements declared underneath the <code>method</code> element.</p>\n\n<p>The implementation of the method is contained inside a <code>body</code> element. The parameters specified are bound to their names in the method body.</p>\n\n<pre>&lt;method name=\"scrollToIndex\"&gt;\n  &lt;parameter name=\"index\"/&gt;\n  &lt;body&gt;\n    &lt;![CDATA[\n      if (index &lt; 0)\n        return;\n      ...\n    ]]&gt;\n  &lt;/body&gt;\n&lt;/method&gt;\n</pre>\n\n<h2 id=\"Properties\" name=\"Properties\">Properties</h2>\n\n<p>Properties can also be defined on the bound element using <code>property</code> tags. There are two basic types of properties. The first type of property is a raw value that is set directly on the element itself. The second type of property is one that defines functions that are invoked when the property is either retrieved or set. These functions are called <em>getters</em> and <em>setters</em> in XBL.</p>\n\n<p>For properties with raw values, an initial value can be specified as a child of the <code>property</code> tag. The script is evaluated at the time of binding attachment and the resulting value is stored on the element. It can be assumed that the anonymous content of the binding has been fully constructed, although the <code>bindingattached</code> event will not have fired. Property initialization always takes place after content generation but before the firing of a binding attachment event, since the <code>bindingattached</code> handler needs to be able to assume that all properties will be accessible on the binding.</p>\n\n<p>Properties with getters and setters can define them using <code>onget</code> and <code>onset</code> attributes, or using the more verbose <code>getter</code> and <code>setter</code> elements. If both the attribute form and the element form are used to specify a getter or setter, then the element form is ignored.</p>\n\n<p>A getter contains script whose return value is handed back when the property is requested. A setter contains a script that is invoked when a new value is assigned to the property. In script, the word <code>val</code> is used to represent the new value.</p>\n\n<p>Properties can be designated as constant using the <code>readonly</code> attribute. When set to <code>true</code>, the property's value cannot be altered. If a property is readonly and a setter is defined, then the setter is ignored.</p>\n\n<p>Properties also support a shorthand syntax for defining getters and setters that forward requests or assignments to an anonymous content element. The <code>element</code> attribute specifies the ID of anonymous content underneath the bound element that should be used when obtained the property or setting the property.</p>\n\n<p>On the anonymous content element, the property can be obtained either from an attribute on the element or from a property on the element. The <code>property</code> attribute's value specifies the name of a property to use on the anonymous content element. The <code>attribute</code> attribute specifies the name of an attribute to use on the anonymous content element. If either of these attributes is specified on the <code>property</code> element, then any defined getters and setters are ignored. A raw initial value is also ignored. If both a property and attribute are specified, then the property takes precedence and the attribute is ignored.</p>\n\n<h2 id=\"Inheritance_of_Implementations\" name=\"Inheritance_of_Implementations\">Inheritance of Implementations</h2>\n\n<p>When two bindings in an inheritance chain both supply implementations, the derived binding's implementation inherits from the base binding's implementation. Method and property lookups are dynamic. Without disambiguating, if two bindings define the same method or property, then the most derived binding's method or property will be used.</p>\n\n<p>Because bindings extend DOM elements, they can override any built-in methods or properties on the DOM element. For example, a binding could override the <code>setAttribute</code> method on <code>Element</code> or the retrieval of the <code>value</code> property for an <code>HTMLInputElement</code>.</p>\n\n<p><em>The following is currently not implemented in Mozilla</em>, it seems. See <a class=\"link-https\" href=\"https://bugzilla.mozilla.org/show_bug.cgi?id=373652\">bug #373652</a> for some details.</p>\n\n<p>Implementations can be named using a <code>name</code> attribute specified on the <code>implementation</code> element. When an implementation has a name, that name can be used to disambiguate the desired method or property.</p>\n\n<div class=\"blockIndicator note\">\n<p><strong>Note:</strong> The following paragraphs suggest a syntax for how JavaScript might enable access to base class methods and properties. This is an open issue. Should we attempt to define a language-independent abstraction, or specify that it must be possible to access base bindings' methods and properties?</p>\n</div>\n\n<p>For example, given a binding with an implementation <code>ColorPickerGrid</code> that derives from an implementation <code>ColorPicker</code> where the two implementations both specify the <code>setColor</code> method, a caller could invoke <code>ColorPicker</code>'s method with the following syntax:</p>\n\n<pre>... // myElement is a ColorPickerGrid\nmyElement.ColorPicker.setColor(); // Calls the ColorPicker method.\nmyElement.setColor(); // Calls the ColorPickerGrid method.\n...\n</pre>\n\n<p>In addition to being able to specifically name a base class, the name <code>baseBinding</code> can be used to specify the method or property on the base binding without necessarily knowing what the base class is. This situation can occur when bindings implicitly inherit, e.g., through the use of <code>addBinding</code>.</p>\n\n<pre>myElement.baseBinding.setColor(); // Calls the ColorPicker method.\n</pre>",
    "contributors": "<a href=\"https://developer.mozilla.org/en-US/profiles/wbamberg\">wbamberg</a>, <a href=\"https://developer.mozilla.org/en-US/profiles/mdnwebdocs-bot\">mdnwebdocs-bot</a>, <a href=\"https://developer.mozilla.org/en-US/profiles/ExE-Boss\">ExE-Boss</a>, <a href=\"https://developer.mozilla.org/en-US/profiles/teoli\">teoli</a>, <a href=\"https://developer.mozilla.org/en-US/profiles/trevorh\">trevorh</a>, <a href=\"https://developer.mozilla.org/en-US/profiles/Sspitzer\">Sspitzer</a>, <a href=\"https://developer.mozilla.org/en-US/profiles/Mgjbot\">Mgjbot</a>, <a href=\"https://developer.mozilla.org/en-US/profiles/BenB\">BenB</a>, <a href=\"https://developer.mozilla.org/en-US/profiles/Andreas%20Wuest\">Andreas Wuest</a>",
    "title": "Binding Implementations"
}