{
    "content": "<p></p><div class=\"prevnext\" style=\"text-align: right;\">\n    <p><a href=\"/en-US/docs/XUL_Tutorial/Persistent_Data\" style=\"float: left;\">« Previous</a><a href=\"/en-US/docs/XUL_Tutorial/Styling_a_Tree\">Next  »</a></p>\n</div><p></p>\n<p>We have hardly modified the look of the elements we have created so far. XUL uses CSS (Cascading Style Sheets) to customize elements.</p>\n<h3 id=\"Style_Sheets\" name=\"Style_Sheets\">Style Sheets</h3>\n<p>A style sheet is a file which contains style information for elements. It was originally designed for HTML elements but can be applied to <a href=\"/en-US/docs/XUL_Reference\">XUL elements</a> also, or to any <a href=\"/en-US/docs/XML\">XML</a> for that matter. The style sheet contains information such as the fonts, colors, borders, and size of elements.</p>\n<p>Mozilla applies a default style sheet to each XUL window. In many cases, it will suffice to leave the defaults as is. Other times, however, you will want to provide a custom style sheet. In general, you will associate a single style sheet with each XUL file.</p>\n<p>You can place a style sheet anywhere you wish. If your XUL file is stored remotely and accessed via an HTTP URL, you can store the style sheet remotely as well. If you are creating a XUL package to be installed as part of the chrome system, you have two choices. First, you could store the style sheet in the same directory as the XUL file. This method has the disadvantage because it means your application will not be themeable. The second method involves placing your files as part of a theme.</p>\n<div class=\"highlight\">\n  <p>Let's assume that we are building the find files dialog for themeability, because the find files dialog can be referred to with the URL <code><a class=\"external\" rel=\"freelink\">chrome://findfile/content/findfile.xul</a></code> so the style sheet file will be stored in <code><a class=\"external\" rel=\"freelink\">chrome://findfile/skin/findfile.css</a></code>.</p>\n</div>\n<p>All the XUL examples so far have actually been using a style sheet already. The second line has always been:</p>\n<pre>&lt;?xml-stylesheet href=\"chrome://global/skin/\" type=\"text/css\"?&gt;\n</pre>\n<p>This line indicates that we want to use the style provided by <code><a class=\"external\" rel=\"freelink\">chrome://global/skin/</a></code>. In Mozilla, this will be translated as the file global.css, which contains default style information for XUL elements. You could leave the line out and the elements will still work, however they will look fairly plain. The style sheet applies various fonts, colors and borders to make the elements look more suitable.</p>\n<h3 id=\"Changing_the_Styles\" name=\"Changing_the_Styles\">Changing the Styles</h3>\n<p>However, there will be times when the default look of elements will not give the look that is desired. For this, we will need to add a style sheet of our own. So far, we have been applying styles using the <code><code id=\"a-style\"><a href=\"https://developer.mozilla.org/en-US/docs/Mozilla/Tech/XUL/Attribute/style\">style</a></code></code> attribute on elements. Although this works, it is not really the best thing to do. It is much better to create a separate style sheet. The reason is so that different looks, or skins, can be applied easily.</p>\n<p>There may be certain cases where the <code><code id=\"a-style\"><a href=\"https://developer.mozilla.org/en-US/docs/Mozilla/Tech/XUL/Attribute/style\">style</a></code></code> attribute is acceptable. An example would be when a script changes the style, or where a difference in layout might change the meaning of the element. However you should avoid this as much as possible.</p>\n<p>For installed files, you'll have to create or modify a manifest file and install the skin.</p>\n<h4 id=\"Our_Find_Files_Dialog_Example\" name=\"Our_Find_Files_Dialog_Example\">Our Find Files Dialog Example</h4>\n<div class=\"highlight\">\n  <p>Let's modify the find files dialog so that its style comes from a separate style file. First, the modifed lines of findfile.xul:</p>\n  <pre class=\"eval\"><span class=\"highlightred\">&lt;?xml-stylesheet href=\"<a class=\"external\" rel=\"freelink\">chrome://global/skin/</a>\" type=\"text/css\"?&gt;</span>\n&lt;?xml-stylesheet href=\"findfile.css\" type=\"text/css\"?&gt;\n  ...\n<span class=\"highlightred\">&lt;spacer class=\"titlespace\"/&gt;</span>\n  &lt;groupbox orient=\"horizontal\"&gt;\n    <span class=\"nowiki\">&lt;caption label=\"Search Criteria\"/&gt;</span>\n\n      &lt;menulist id=\"searchtype\"&gt;\n        &lt;menupopup&gt;\n          &lt;menuitem label=\"Name\"/&gt;\n          &lt;menuitem label=\"Size\"/&gt;\n          &lt;menuitem label=\"Date Modified\"/&gt;\n        &lt;/menupopup&gt;\n      &lt;/menulist&gt;\n      <span class=\"highlightred\">&lt;spacer class=\"springspace\"/&gt;</span>\n      &lt;menulist id=\"searchmode\"&gt;\n        &lt;menupopup&gt;\n          &lt;menuitem label=\"Is\"/&gt;\n          &lt;menuitem label=\"Is Not\"/&gt;\n        &lt;/menupopup&gt;\n      &lt;/menulist&gt;\n\n      <span class=\"highlightred\">&lt;spacer class=\"springspace\"/&gt;\n      &lt;menulist id=\"find-text\" flex=\"1\"</span>\n          editable=\"true\"\n          datasources=\"<a class=\"external\" rel=\"freelink\">file:///mozilla/recents.rdf</a>\"\n          ref=\"<span class=\"nowiki\">http://www.xulplanet.com/rdf/recent/all</span>\"/&gt;\n  ...\n<span class=\"highlightred\">&lt;spacer class=\"titlespace\"/&gt;\n&lt;hbox&gt;\n\n  &lt;progressmeter id=\"progmeter\" value=\"50%\" style=\"display:none;\"/&gt;</span>\n</pre>\n  <p>The new <code>xml-stylesheet</code> line is used to import the style sheet. It will contain the styles instead of having them directly in the XUL file. You can include any number of style sheets in a similar way. Here the style sheet is placed in the same directory as findfile.xul.</p>\n  <p>Some of the styles in the code above have been removed. One that wasn't was the <code>display</code> property on the <code>progressmeter</code>. This will be changed by a script so it was left in, as it doesn't really make sense to have the progress bar visible initially. You could still put this in a separate style sheet if you really wanted to. A <code>class</code> was added to the spacers so that they can be referred to.</p>\n  <p>A style sheet also needs to be created. Create a file findfile.css in the same directory as the XUL file. (It would normally be put into a separate skin). In this file, we'll add the style declarations, as shown below:</p>\n  <pre>#find-text {\n  min-width: 15em;\n}\n\n#progmeter {\n  margin: 4px;\n}\n\n.springspace {\n  width: 10px;\n}\n\n.titlespace {\n  height: 10px;\n}\n</pre>\n  <p>Notice how these styles are equivalent to the styles we had before. However, it is much easier for someone to change the look of the find files dialog now because they could add or modify the style declarations by either modifying the file or by changing the skin. If the user changes the interface skin, the files in a directory other than default will be applied.</p>\n</div>\n<h3 id=\"Importing_Style_Sheets\" name=\"Importing_Style_Sheets\">Importing Style Sheets</h3>\n<p>We've already seen how to import style sheets for use. An example is shown below:</p>\n<pre>&lt;?xml-stylesheet href=\"chrome://bookmarks/skin/\" type=\"text/css\"?&gt;\n</pre>\n<p>This might be the first lines of a bookmarks window. It imports the bookmarks style sheet, which is bookmarks.css. Mozilla's skin system is smart enough to figure out which style sheet to use, because the specific filename was not indicated here. We have done a similar thing with the global style sheet file (<a class=\"external\" rel=\"freelink\">chrome://global/skin</a>).</p>\n<p>A style sheet may import styles from another stylesheet using the import directive. Normally, you will only import one style sheet from each XUL file. The global style sheet can be imported from within the style sheet associated with the XUL file. This can be done with the code below, allowing you to remove the import from the XUL file:</p>\n<pre class=\"eval\"><b>Style import from XUL:</b>\n&lt;?xml-stylesheet href=\"<a class=\"external\" rel=\"freelink\">chrome://global/skin/</a>\"  type=\"text/css\"?&gt;\n\n<b>Style import from CSS:</b>\n@import url(<a class=\"external\" rel=\"freelink\">chrome://global/skin/</a>);\n</pre>\n<p>The second syntax is preferred because it reduces the number of dependencies within the XUL file itself.</p>\n<div class=\"highlight\">\n  <p>Remove the global style sheet import from findfile.xul and add the import to findfile.css.</p>\n</div>\n<p>All elements can be styled using <a href=\"/en-US/docs/CSS\">CSS</a>. You can use selectors to select the element that you wish to have styled. (The selector is the part before the curly brace in a style rule). The following list summarizes some of the selectors available:</p>\n<dl>\n  <dt>\n    button </dt>\n  <dd>\n    Matches all button tags.</dd>\n  <dt>\n    #special-button </dt>\n  <dd>\n    Matches the element with an <code>id</code> of <code>special-button</code>.</dd>\n  <dt>\n    .bigbuttons </dt>\n  <dd>\n    Matches all elements with a <code>class</code> of <code>bigbuttons</code>.</dd>\n  <dt>\n    button.bigbuttons </dt>\n  <dd>\n    Matches all button elements with a <code>class</code> of <code>bigbuttons</code>.</dd>\n  <dt>\n    toolbar &gt; button </dt>\n  <dd>\n    Matches all buttons that are directly inside toolbar elements.</dd>\n  <dt>\n    toolbar &gt; button.bigbuttons </dt>\n  <dd>\n    Matches all button elements with a <code>class</code> of <code>bigbuttons</code> that are directly inside toolbar elements.</dd>\n  <dt>\n    button.bigbuttons:hover </dt>\n  <dd>\n    Matches all button elements with a <code>class</code> of <code>bigbuttons</code> but only while the mouse is over them.</dd>\n  <dt>\n    button#special-button:active </dt>\n  <dd>\n    Matches all button elements with an <code>id</code> of <code>special-button</code> but only while they are active (being clicked on).</dd>\n  <dt>\n    box[orient=\"horizontal\"]</dt>\n  <dd>\n    Matches all box elements that have an <code>orient</code> attribute that is set to <code>horizontal</code>.</dd>\n</dl>\n<p>You can combine these rules in any way that you wish. It is always a good idea to be as precise as possible when specifying what gets styled. It is more efficient and it also reduces the likelihood that you'll style the wrong thing.</p>\n<div class=\"highlight\">\n  <p><span id=\"Find_files_example_so_far\"><a id=\"Find_files_example_so_far\"></a><strong>Find files example so far</strong></span> : <a href=\"https://developer.mozilla.org/samples/xultu/examples/findfile/findfile-style.xul.txt\">Source</a> <a href=\"https://developer.mozilla.org/samples/xultu/examples/findfile/findfile-style.xul\">View</a></p>\n</div>\n<p>In the next section, we will look at how to apply styles to trees.</p>\n<p></p><div class=\"prevnext\" style=\"text-align: right;\">\n    <p><a href=\"/en-US/docs/XUL_Tutorial/Persistent_Data\" style=\"float: left;\">« Previous</a><a href=\"/en-US/docs/XUL_Tutorial/Styling_a_Tree\">Next  »</a></p>\n</div><p></p>",
    "contributors": "<a href=\"https://developer.mozilla.org/en-US/profiles/wbamberg\">wbamberg</a>, <a href=\"https://developer.mozilla.org/en-US/profiles/mdnwebdocs-bot\">mdnwebdocs-bot</a>, <a href=\"https://developer.mozilla.org/en-US/profiles/Sheppy\">Sheppy</a>, <a href=\"https://developer.mozilla.org/en-US/profiles/teoli\">teoli</a>, <a href=\"https://developer.mozilla.org/en-US/profiles/trevorh\">trevorh</a>, <a href=\"https://developer.mozilla.org/en-US/profiles/fscholz\">fscholz</a>, <a href=\"https://developer.mozilla.org/en-US/profiles/Chbok\">Chbok</a>, <a href=\"https://developer.mozilla.org/en-US/profiles/Mgjbot\">Mgjbot</a>, <a href=\"https://developer.mozilla.org/en-US/profiles/Morishoji\">Morishoji</a>, <a href=\"https://developer.mozilla.org/en-US/profiles/Ptak82\">Ptak82</a>, <a href=\"https://developer.mozilla.org/en-US/profiles/Pmash\">Pmash</a>, <a href=\"https://developer.mozilla.org/en-US/profiles/SylvainPasche\">SylvainPasche</a>, <a href=\"https://developer.mozilla.org/en-US/profiles/Dria\">Dria</a>",
    "title": "Adding Style Sheets"
}