{
    "content": "<p></p><div class=\"prevnext\" style=\"text-align: right;\">\n    <p><a href=\"/en-US/docs/XUL_Tutorial/Creating_an_Installer\" style=\"float: left;\">« Previous</a><a href=\"/en-US/docs/XUL_Tutorial/Additional_Install_Features\">Next  »</a></p>\n</div><p></p>\n<p>This section describes the install script.</p>\n<h3 id=\"Creating_an_Install_Script\">Creating an Install Script</h3>\n<div class=\"note\">\n  <strong>Note</strong>: For Firefox Extensions, <code>install.js</code> are no longer used. You should create a <code><a href=\"/en-US/docs/Install_Manifests\" title=\"Install_Manifests\">install.rdf</a></code> instead.</div>\n<p>You will usually want some form of control over your install process. For example, you may wish to check versions of files and only install updated files, or perhaps you wish to apply patches to existing files. The install script is even flexible enough to allow you to uninstall files. For this reason, installers include an install script to handle the installation process.</p>\n<p>The installer script must be called install.js and must be placed at the top level of the installer archive. The script will contain JavaScript code which calls a number of install functions.</p>\n<p>In an HTML document, or a XUL document, the window object is the root global object. That means that you can call the methods of the window object with the qualifier before it, which means that <code>window.open()</code> can simply be written <code>open()</code>. In an install script, there is no associated window, however the global object will be an <em>Install</em> object which contains a number of functions to customize the install process. Some of the Install object's functions will be described below.</p>\n<p>The install script should take the following steps:</p>\n<ol>\n  <li>Initialize the installation by specifying what package and version is being installed.</li>\n  <li>Use the Install functions to indicate what files and directories need to be installed. You can also set files to be moved and deleted.</li>\n  <li>Start the process of installing the necessary files.</li>\n</ol>\n<p>It is important to note that during step two, you only indicate which files should be installed and any other operations you wish to have happen. No files get copied until step three. Because of this, you can easily specify a number of files to be installed, come across some kind of error, and abort the whole process without modifying the user's system.</p>\n<h3 id=\"The_Component_Registry\">The Component Registry</h3>\n<p>Mozilla maintains a file which is a registry of all the components that are currently installed. Components include new chrome packages, skins and plugins. When a new component is installed, the registry gets updated. The registry also stores the set of files and version information about the installed components. That way, it is easier to check if a version of your component is already present and only update it if necessary.</p>\n<p>The component registry works somewhat like the Windows registry does. It consists of a hierarchy of keys and values. You don't need to know much about it to create XUL applications unless you are creating your own <a href=\"/en-US/docs/XUL_Tutorial/XPCOM_Interfaces\" title=\"XUL_Tutorial/XPCOM_Interfaces\">XPCOM</a> components.</p>\n<p>What you do need to know for an installation is that the registry stores a set of information about your application, such as the file list and versions. All of this information is stored in a key (and within subkeys) that you provide in the installation script (in step 1 mentioned above).</p>\n<p>This key is structured as directory-like path of the following form:</p>\n<pre>/Author/Package Name\n</pre>\n<p>Replace the word Author with your name and replace the Package Name with the name of the package that you are installing. For example:</p>\n<pre>/Xulplanet/Find Files\n\n/Netscape/Personal Security Manager\n</pre>\n<p>The first example is what we'll use for the find files dialog. The second is the key used for the Personal Security Manager.</p>\n<h3 id=\"Install_Initialization\">Install Initialization</h3>\n<p>The Install object has a function, <code>initInstall()</code> which can be used to initialize for the installation. It should be called at the beginning of your installation script. The syntax of this function is as follows:</p>\n<pre>initInstall( ''packageName'' , ''regPackage'' , ''version'' );</pre>\n<p>An example</p>\n<pre>initInstall(\"Find Files\",\"/Xulplanet/Find Files\",\"0.5.0.0\");</pre>\n<ul>\n  <li>The first argument is the name of the package in user-readable form.</li>\n  <li>The second argument is the registry key used to hold the package information as described earlier.</li>\n  <li>The third argument is the version of the package being installed.</li>\n</ul>\n<p>Next, we need to set the directory where the files will be installed. There are two ways to do this.</p>\n<ul>\n  <li>The simple method assigns an install directory and installs all files into it.</li>\n  <li>The second method allows you to assign a destination on a per-file (or directory) basis. The first method is described below.</li>\n</ul>\n<p>The function <code>setPackageFolder()</code> assigns an installation directory. For the find files dialog, we will install the files into the chrome directory. (We could actually put them anywhere though.) The <code>setPackageFolder()</code> takes one argument, the directory to install to. For maximum portability, you can't specify a string name for the directory. Instead, you specify an identifier of a known directory and get subdirectories of it. Thus, if your application needed to install some system libraries, you don't need to know the name of those directories.</p>\n<p>The directory identifiers are listed on <a href=\"/en-US/docs/XPInstall_API_Reference/Install_Object/Methods/getFolder\">this page</a>. For the chrome directory, the directory identifier is 'Chrome'. The <code>getFolder()</code> function can be used to get one of these special directories. This function takes two arguments, the first is the identifier and the second is a subdirectory. For example:</p>\n<pre>findDir = getFolder(\"Chrome\",\"findfile\");\nsetPackageFolder(findDir);\n</pre>\n<p>Here, we get findfile folder in the Chrome folder and pass it directly to the <code>setPackageFolder()</code> function. The second argument to <code>getFolder()</code> is the subdirectory which we are going to install into, which doesn't have to exist. You can leave this argument out entirely if you don't need one.</p>\n<h3 id=\"Setting_Install_Files\" name=\"Setting_Install_Files\">Setting Install Files</h3>\n<p>Next, you need to specify which files should be installed. This involves the use of two functions, <code>addDirectory()</code> and <code>addFile()</code>. The <code>addDirectory()</code> function tells the installer that a directory from the XPI archive (and all of its contents) should be installed to a particular location. The <code>addFile()</code> is similar but for a single file.</p>\n<p>Both the <code>addDirectory()</code> and <code>addFile()</code> functions have various forms. The simplest takes only one argument, the directory from the installer to install to the assigned installation directory.</p>\n<pre class=\"eval\">addDirectory ( <em>dir</em> );\naddFile ( <em>dir</em> );\n\n<strong>Example:</strong>\n\naddDirectory(\"findfile\");\n</pre>\n<p>The example above will specify that the findfile directory from the installer archive should be installed. We can call these functions multiple times to install other files.</p>\n<p>Next, we'll want to register the find files in the chrome system so that it can be used with a chrome URL. This can be done with the <code>registerChrome()</code> function. It takes two arguments, the first is the type of chrome to register (content, skin or locale). The second is the directory containing the contents.rdf file to register. Because the find files dialog contains content, a skin file and a locale file, <code>registerChrome()</code> will need to be called three times.</p>\n<pre>registerChrome(Install.CONTENT | Install.DELAYED_CHROME, getFolder(findDir, \"content\"));\nregisterChrome(Install.SKIN | Install.DELAYED_CHROME, getFolder(findDir, \"skin\"));\nregisterChrome(Install.LOCALE | Install.DELAYED_CHROME, getFolder(findDir, \"locale\"));\n</pre>\n<p>The DELAYED_CHROME flag is used to indicate that the chrome should be installed the next time Mozilla is run.</p>\n<h3 id=\"Installation_Completion\">Installation Completion</h3>\n<p>The <code>addDirectory()</code> and <code>addFile()</code> functions don't copy any files. They only state which files should be installed. Similarly, <code>registerChrome()</code> only states that chrome should be registered. To complete the process and begin copying files, call the <code>performInstall()</code> function. It takes no arguments.</p>\n<p>The final script for installing the find files component is shown below:</p>\n<div class=\"highlight\">\n  <p><a href=\"https://developer.mozilla.org/samples/xultu/examples/ex_xpiscript_1.js.txt\">Source</a></p>\n  <pre>initInstall(\"Find Files\",\"/Xulplanet/Find Files\",\"0.5.0.0\");\n\nfindDir = getFolder(\"Chrome\",\"findfile\");\nsetPackageFolder(findDir);\n\naddDirectory(\"findfile\");\n\nregisterChrome(Install.CONTENT | Install.DELAYED_CHROME, getFolder(findDir, \"content\"));\nregisterChrome(Install.SKIN | Install.DELAYED_CHROME, getFolder(findDir, \"skin\"));\nregisterChrome(Install.LOCALE | Install.DELAYED_CHROME, getFolder(findDir, \"locale\"));\n\nperformInstall();\n</pre>\n</div>\n<p>Next, we'll look at some <a href=\"/en-US/docs/XUL_Tutorial/Additional_Install_Features\" title=\"XUL_Tutorial/Additional_Install_Features\">additional install functions</a>.</p>\n<p></p><div class=\"prevnext\" style=\"text-align: right;\">\n    <p><a href=\"/en-US/docs/XUL_Tutorial/Creating_an_Installer\" style=\"float: left;\">« Previous</a><a href=\"/en-US/docs/XUL_Tutorial/Additional_Install_Features\">Next  »</a></p>\n</div><p></p>",
    "contributors": "<a href=\"https://developer.mozilla.org/en-US/profiles/wbamberg\">wbamberg</a>, <a href=\"https://developer.mozilla.org/en-US/profiles/mdnwebdocs-bot\">mdnwebdocs-bot</a>, <a href=\"https://developer.mozilla.org/en-US/profiles/Sheppy\">Sheppy</a>, <a href=\"https://developer.mozilla.org/en-US/profiles/teoli\">teoli</a>, <a href=\"https://developer.mozilla.org/en-US/profiles/trevorh\">trevorh</a>, <a href=\"https://developer.mozilla.org/en-US/profiles/fscholz\">fscholz</a>, <a href=\"https://developer.mozilla.org/en-US/profiles/Chbok\">Chbok</a>, <a href=\"https://developer.mozilla.org/en-US/profiles/Mgjbot\">Mgjbot</a>, <a href=\"https://developer.mozilla.org/en-US/profiles/Morishoji\">Morishoji</a>, <a href=\"https://developer.mozilla.org/en-US/profiles/Pmash\">Pmash</a>, <a href=\"https://developer.mozilla.org/en-US/profiles/Ptak82\">Ptak82</a>, <a href=\"https://developer.mozilla.org/en-US/profiles/Dria\">Dria</a>",
    "title": "Install Scripts"
}